app/Controllers/Admin/Advertisements.php

    public function index()
    {
      $AdvertisementsModel = new AdvertisementsModel();
      $data['advertisements'] = $AdvertisementsModel->findAll();
---
SELECT *
FROM `advertisements`