app/Controllers/Admin/News.php

SELECT *
FROM `news`
---
    public function index()
    {
      $NewsModel = new NewsModel();
      $data['products'] = $NewsModel->findAll();

INSERT INTO `news` (`title`, `description`, `image`) VALUES ('ಮೋದಿಜಿ ನೀಡಿದ ಲಸಿಕೆ ಕೆಲಸ ಆರಂಭಿಸಿದೆ...', 'ಮೋದಿಜಿ ನೀಡಿದ ಲಸಿಕೆ ಕೆಲಸ ಆರಂಭಿಸಿದೆ...\r\nಮೋದಿಜಿ ನೀಡಿದ ಲಸಿಕೆ ಕೆಲಸ ಆರಂಭಿಸಿದೆ...\r\nಮೋದಿಜಿ ನೀಡಿದ ಲಸಿಕೆ ಕೆಲಸ ಆರಂಭಿಸಿದೆ.\r\n', '1686246522_e27577ce02307d1b4b1d.jpg')
---
   public function store()
   {
      if ($this->request->getMethod() == 'post') {
         $rules = [
             'title' => 'required',
             'description' => 'required',
         //     'image' => [
         //       'label' => 'image file should be of type .jpg, png, or pdf',
         //       'rules' => 'mime_in[doc,image/jpg,image/jpeg,image/png,application/pdf]'
         //   ],
         ];
         if ($this->validate($rules)) {

             $data = [
                 'title' => $this->request->getPost('title'),
                 'description' => $this->request->getPost('description'),
                 //'created_at' => date('Y-m-d H:i:s'),
             ];
             $file = $this->request->getFile('image');
             if ($file->isValid() && !$file->hasMoved()) {
                 $imageName = $file->getRandomName();
                 $file->move('uploads/', $imageName);
                 $data['image'] = $imageName;
             }

             $product = $this->NewsModel->save($data);