app/Controllers/Home.php

    public function index()
    {

        $NewsModel = new NewsModel();
        $AdvertisementsModel = new AdvertisementsModel();
        $data['advertisements'] = $AdvertisementsModel->findAll();

      $data['news'] = $NewsModel->findAll();
---
SELECT *
FROM `advertisements`
SELECT *
FROM `news`